# human.py
class Human:
    def __init__(...):
        # здесь код

    def eating(...):
        # здесь код    

    def sleeping(...):
        # здесь код

    def working(...):
        # здесь код
        
    def relaxing(...):
        # здесь код

    def growing(...):
        # здесь код

class Life:
    def life(self, human, years=70):
        while years:            
            human.growing()
            human.eating()
            human.sleeping()
            human.working()
            human.relaxing()
            years -= 1
        
petr = Human('Петр')
life_petr = Life()
life_petr.life(petr)

'''
Родился человек с именем Петр
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр работает
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр на пенсии
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр на пенсии
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр на пенсии
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр на пенсии
Петр отдыхает
Петр отмечает день рождения
Петр ест
Петр спит
Петр на пенсии
Петр отдыхает
'''
